{
    "head": {
      "title": "Proyectos",
      "option-moreOptions": "Mas opciones",
      "option-share": "Compartir",
      "text-1": "Cada trabajo ",
      "strong-1": "no solo muestra mis competencias técnicas, ",
      "text-2": "sino también mi enfoque ",
      "strong-2": "creativo y mi dedicación a crear soluciones ",
      "text-3": "de diseño que sean ",
      "strong-3": "usables, accesibles y estéticas."
    },
    "viflow": {
      "description": "ViFlow es una red social desarrollada con TypeScript que permite a los usuarios registrarse, crear perfiles, publicar contenido, interactuar con posts y comentar. Con un diseño completamente responsive y manejo avanzado de rutas, ofrece una experiencia con características únicas.",
      "shortDescription": "Red social interactiva con registro de usuarios, publicaciones y comentarios.",
      "objective": "El proyecto surgió para resolver la necesidad de una red social minimalista pero funcional, con el objetivo de crear una plataforma donde usuarios puedan compartir contenido, interactuar y formar comunidades, implementando características clave como registro, perfiles, posts y comentarios con TypeScript para garantizar escalabilidad y mantenibilidad.",
      "development": "Utilicé React con TypeScript para el desarrollo frontend, implementando react-router para la navegación. Para la UI, prioricé un diseño responsive con Tailwind, integrando Zustand para estados globales, interacciones en tiempo real",
      "conclusion": "El resultado fue una aplicación funcional que demostró mi capacidad para resolver problemas complejos en entornos sociales. Entre los aprendizajes clave destacan: la importancia de la tipificación en proyectos grandes (TypeScript), estrategias para manejar estados globales en aplicaciones sociales, y cómo diseñar interfaces intuitivas para flujos de interacción complejos."
    },
    "urbanShop": {
      "description": "Urban Shop es una tienda en línea diseñada para la venta de zapatos y gorras, con una interfaz atractiva y dinámica. Desarrollé un e-commerce completo con funcionalidades principales como carrito de compras persistente y sliders interactivos, brindando una experiencia de usuario fluida e intuitiva.",
      "shortDescription": "E-commerce funcional de zapatos y gorras con carrito persistente y diseño dinámico.",
      "objective": "El proyecto buscaba crear un e-commerce funcional para UrbanShop que resolviera los desafíos típicos de una tienda online: gestión del carrito de compras, exhibición atractiva de productos y persistencia de datos entre sesiones, con el objetivo de ofrecer una experiencia de usuario fluida y profesional.",
      "development": "Implementé una arquitectura robusta con React y Redux Toolkit para manejar el estado global del carrito, integrando localStorage para persistencia de datos. Para la interfaz, utilicé TailwindCSS junto con SplideJS para crear sliders interactivos, desarrollando un diseño completamente responsive con Vite como build tool para optimizar el rendimiento.",
      "conclusion": "El resultado fue una tienda online 100% funcional con carrito persistente y tiempo de carga optimizado. Entre los aprendizajes clave destacan: dominio de Redux Toolkit para gestión de estado, técnicas avanzadas de persistencia con localStorage, y cómo implementar sliders profesionales con SplideJS en aplicaciones React."
    },
    "frameonix": {
      "description": "Frameonix es la plataforma web diseñada para documentar mi librería de componentes, proporcionando una introducción detallada, guía de instalación y uso, información sobre cómo contribuir y documentación específica de cada componente disponible. Esta web cuenta con una interfaz dinámica, navegación mediante rutas, y un diseño intuitivo para garantizar una excelente experiencia de usuario.",
      "shortDescription": "Documentación completa e interactiva para mi librería de componentes Frameonix.",
      "objective": "El proyecto nació para resolver el desafío de documentar eficientemente la librería FrameOnix, con el objetivo claro de crear una plataforma que permitiera a otros desarrolladores entender rápidamente su funcionamiento, instalación y uso, reduciendo la curva de aprendizaje y fomentando la adopción de la librería.",
      "development": "Desarrollé una solución completa con React y Vite para optimizar el rendimiento, implementando react-router-dom para la navegación entre secciones y i18next para soporte multiidioma. Utilicé IntersectionObserver para la detección de secciones activas y creé componentes interactivos como una terminal simulada, todo ello con TailwindCSS para garantizar un diseño responsive y coherente.",
      "conclusion": "La documentación resultante demostró ser intuitiva y efectiva, mejorando significativamente la experiencia de los desarrolladores al usar la librería. Entre los aprendizajes clave destacan: manejo avanzado de rutas en React, implementación de internacionalización con i18next, y técnicas para crear documentación interactiva que mejora la adopción de herramientas técnicas."
    },
    "consultora": {
      "description": "Participé en un proyecto freelance para la consultora de negocios, colaborando estrechamente con un equipo de diseño y desarrollo para la página web de la consultora. Mi rol incluyó la creación de una interfaz intuitiva y la optimización de la experiencia y performance de la web, reflejando la visión y profesionalismo, y logrando destacar la calidad y el compromiso del equipo.",
      "shortDescription": "Landing atractiva y funcional que destaca la presencia en línea de una consultora de negocios.",
      "objective": "La app de Mostaza presentó una caída en pedidos, señalando una pérdida de usuarios debido a una experiencia deficiente, falta de incentivos y competencia con otras apps. El objetivo fue analizar comportamientos, motivaciones y puntos de dolor para optimizar la experiencia, fidelizar clientes y fortalecer su posición en el mercado.",
      "development": "Apliqué el enfoque del doble diamante, explorando en la primera fase los comportamientos y necesidades de los usuarios a través de investigación cualitativa. En la segunda fase, describí los puntos de dolor y oportunidades clave mediante el análisis de datos. Luego, creé soluciones enfocadas en prototipos interactivos, y finalmente, evalué estas propuestas con pruebas de usabilidad, asegurando una experiencia optimizada y alineada con las expectativas del usuario.",
      "conclusion": "Gracias al estratégico plan de investigación, logré mejorar la usabilidad en un 83%, simplificando la arquitectura y la navegación para adaptarla a las necesidades reales de los usuarios. Esto se tradujo en una reducción significativa del tiempo al hacer un pedido y un aumento de la confianza en la app. Además, descubrí la importancia de personalizar la experiencia del usuario a través de incentivos, lo que resultó en una mayor fidelización."
    },
    "cineverse": {
      "description": "Cineverse es una plataforma interactiva de películas que consume la API de TMDB para mostrar información actualizada. Desarrollé un diseño dinámico con una pancarta principal que cambia aleatoriamente y filtros por categoría, implementando un sistema eficiente de gestión de estados para una experiencia de usuario fluida y atractiva.",
      "shortDescription": "Plataforma de películas interactiva con contenido dinámico obtenido de la API de TMDB y filtros por categoría.",
      "objective": "El proyecto buscaba crear una plataforma de películas que mostrara contenido siempre actualizado mediante el consumo de la API de TMDB, con un diseño interactivo que incluyera una pancarta principal dinámica y filtros por categoría para mejorar la experiencia de descubrimiento de películas.",
      "development": "Implementé un sistema de peticiones a la API de TMDB usando React, desarrollando una interfaz con banner aleatorio que cambia con cada recarga o al seleccionar categorías. Utilicé gestión de estados avanzada para manejar los datos obtenidos y crear filtros dinámicos, optimizando el rendimiento con técnicas de lazy loading para las imágenes.",
      "conclusion": "El resultado fue una plataforma 100% funcional que muestra películas actualizadas diariamente, con una interfaz atractiva y fluida. Entre los aprendizajes clave destacan: consumo de APIs externas, implementación de filtros dinámicos, manejo avanzado de estados en React y técnicas para crear interfaces interactivas que mejoran la experiencia de usuario."
    },
    "whatsappClone": {
      "description": "WhatsApp Clone es una web frontend desarrollada en conjunto con 6 compañeros, donde replicamos y personalizamos varias secciones de la web oficial de WhatsApp. El objetivo principal fue adquirir experiencia en trabajo en equipo y expandir mis conocimientos utilizando frameworks, ya que era la primera vez que trabajaba con ellos. Implementamos funcionalidades clave y personalizamos la experiencia de usuario.",
      "shortDescription": "Réplica de WhatsApp Web desarrollada en equipo con React y Material UI.",
      "objective": "El proyecto nació como un ejercicio de aprendizaje colaborativo para replicar la funcionalidad de WhatsApp Web, con el objetivo de adquirir experiencia en trabajo en equipo y familiarizarnos con frameworks modernos como React, Material UI y Tailwind CSS.",
      "development": "Desarrollamos una solución completa que incluye autenticación, perfil de usuario, chat funcional con envío de mensajes y emojis, estados de usuarios y edición de perfil. Implementamos Material UI para los componentes de interfaz y Tailwind CSS para la personalización del tema de colores, junto con react-router para la navegación entre secciones.",
      "conclusion": "El proyecto resultó en una aplicación funcional que demostró nuestra capacidad para trabajar en equipo y aprender nuevas tecnologías rápidamente. Entre los aprendizajes clave destacan: manejo de rutas en React, consumo de librerías de componentes (Material UI), implementación de temas con Tailwind CSS, y valiosas habilidades de colaboración usando metodología Scrum."
    }
  }